Autodesk.Navisworks.Api.Model
Represents a loaded model within the model hierarchy

Autodesk.Navisworks.Api.Model.Creator
Name of creating file loader or design application. Null if unknown.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Model.Equals(System.Object)
Determines whether the specified object and the current object refer to the same
underlying native object. Returns false if either object has been disposed.

Autodesk.Navisworks.Api.Model.FileName
Filename this model was loaded from
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Model.FrontVector
Preferred front vector for model. Will be zero if no front vector defined.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Model.GetHashCode
Serves as a hash function for a particular type.  is suitable for use in hashing algorithms and data structures like a hash table.
Returns: A hash code for the current .

Autodesk.Navisworks.Api.Model.Guid
Globally unique identifier for this model
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Model.HasFrontVector
Is there a front vector defined for model ?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Model.HasNorthVector
Is there a north vector defined for model ?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Model.HasRightVector
Is there a right vector defined for model ?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Model.HasUpVector
Is there an up vector defined for model ?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Model.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.Model.IsTransformReflected
Is the transform reflected.

Autodesk.Navisworks.Api.Model.NorthVector
Preferred north vector for model. Will be zero if no north vector defined.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Model.PublishProperties
Properties specified when model was last published. Will be null if model has not been published.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Model.RightVector
Preferred right vector for model. Will be zero if no right vector defined.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Model.RootItem
Root item of the model hierarchy corresponding to this model
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Model.SchemaDefinitions
Schema definitions in use by this model.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Model.SourceFileName
Original source filename this model was first converted from. Null if unknown.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Model.SourceGuid
Get original Guid that this model was created with. Guid may be modified to ensure all models within a sheet have unique Guids. If the same model is appended to a sheet twice, each model has the same SourceGuid but different Guids.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Model.Transform
Transform applied to the model.

Autodesk.Navisworks.Api.Model.Units
Units in which dimensions of this model are defined
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Model.UpVector
Preferred up vector for model. Will be zero if no up vector defined.
Throws System.ObjectDisposedException:
Object has been Disposed